app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("name", "phone", "email", "avatar", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Lina Montoya"], ["phone", "333333"], ["email", "montoyalinaj@gmail.com"], ["avatar", nil], ["created_at", "2016-04-02 14:51:03.628149"], ["updated_at", "2016-04-02 14:51:03.628149"]]
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save

UPDATE "contacts" SET "avatar" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["avatar", "octobiwan.jpg"], ["updated_at", "2016-04-02 14:53:40.655792"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @contact.update(contact_params)